src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ЗаявкаНаРасходДС</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Подотчет</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииРасходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПКО</name>
    <type>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПодотчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидОперацииРасходныйКассовыйОрдер/ВидОперацииРасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииРасходныйКассовыйОрдер</name>
  <enumValues>
    <name>ВыдачаВПодотчет</name>
  </enumValues>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассу</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <attributes>
    <name>ВидЗаявки</name>
    <type>
      <types>CatalogRef.ВидыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесПеревес</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесПЛ</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспорта</name>
      <type>
        <types>EnumRef.ВидТранспорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗакрытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРейса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Линия</name>
      <type>
        <types>CatalogRef.Линия</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоДоставки</name>
      <type>
        <types>CatalogRef.ГородаОбластиРайоны</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемКонтейнера</name>
      <type>
        <types>EnumRef.ОбъемКонтейнера</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пакинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>CatalogRef.Порты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаОтправления</name>
      <type>
        <types>CatalogRef.Страны</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Экспедитор</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасходныйКассовыйОрдер/ManagerModule.bsl
Функция Проведение ( Данные ) Экспорт
	
	получитьДанные ( Данные );
	сформироватьДенежныеСредства ( Данные );
	сформироватьДвиженияДенежныхСредств ( Данные );
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.Оплата ) Тогда
		сформироватьВзаиморасчеты ( Данные );
		сформироватьДоходыРасходы ( Данные );
	ИначеЕсли ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.ВыдачаВПодотчет ) Тогда
		Если ( НЕ Данные.Шапка.НеУчитыватьПодотчет ) Тогда
			сформироватьПодотчет ( Данные );	
		КонецЕсли;		
	ИначеЕсли ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.Прочее ) Тогда
		сформироватьВзаиморасчеты ( Данные );
		сформироватьДоходыРасходы ( Данные );
	КонецЕсли; 
	установитьФлагиЗаписи ( Данные );
	Возврат ИСТИНА;
	
КонецФункции

Процедура получитьДанные ( Данные )
	
	текст = "
	|// ~Шапка
	|выбрать 
	|	Ссылка как Ссылка, Номер как Номер, Дата как Дата, ДатаОперации как ДатаОперации,
	|	Касса как Касса, Контрагент как Контрагент, НазначениеПлатежа как НазначениеПлатежа,
	|	НомерКвитанции как НомерКвитанции, Основание как Основание, Пост как Пост, Сумма как Сумма, 
	|	Валюта как Валюта, Организация как Организация, СуммаПлатежа как СуммаПлатежа, 
	|	СуммаКомиссии как СуммаКомиссии, Сотрудник как Сотрудник, ВидОперации как ВидОперации,
	|	НеУчитыватьПодотчет как НеУчитыватьПодотчет, СтатьяДДС как СтатьяДДС,
	|	ДолгПоВалютам как ДолгПоВалютам 
	|из 
	|	Документ.РасходныйКассовыйОрдер
	|где 
	|	Ссылка = &Ссылка
	|;
	|выбрать
	|	Валюта как Валюта,
	|	Сумма как Сумма
	|из
	|	Документ.РасходныйКассовыйОрдер.Оплаты
	|где
	|	Ссылка = &Ссылка  
	|";
	запрос = Новый Запрос ( текст );
	запрос.УстановитьПараметр ( "Ссылка", Данные.Ссылка );
	результат = запрос.ВыполнитьПакет ();
	выборкаШапка = результат [ 0 ].Выбрать ();
	выборкаШапка.Следующий ();
	Данные.Вставить ( "Шапка", выборкаШапка );
	Данные.Вставить ( "Оплаты", результат [ 1 ].Выгрузить () );

КонецПроцедуры

Процедура сформироватьВзаиморасчеты ( Данные )
	
	п = Данные.Шапка;
	Если ( п.ДолгПоВалютам ) Тогда
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.Взаиморасчеты.ДобавитьПриход ();
			движение.Период = п.Дата;
			движение.Контрагент = п.Контрагент;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Заявка = Документы.Заявка.ПустаяСсылка ();
			движение.Организация = п.Организация;
			движение.Сумма = строкаТЗ.Сумма;
		КонецЦикла;		
	Иначе
		Если ( п.Сумма <> 0 ) Тогда
			движение = Данные.Движения.Взаиморасчеты.ДобавитьПриход ();
			движение.Период = п.Дата;
			движение.Контрагент = п.Контрагент;
			движение.Валюта = п.Валюта;
			движение.Заявка = Документы.Заявка.ПустаяСсылка ();
			движение.Организация = п.Организация;
			движение.Сумма = п.Сумма;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура сформироватьДоходыРасходы ( Данные )
	
	п = Данные.Шапка;
	Если ( Данные.Шапка.СуммаКомиссии = 0 ) Тогда
		Возврат;
	КонецЕсли; 
	движение = Данные.Движения.ДоходыРасходы.Добавить ();
	движение.Период = п.Дата;
	// движение.Заявка = Данные.Шапка.Заявка;
	движение.Валюта = п.Валюта;
	движение.Номенклатура = Справочники.Номенклатура.КомиссияКасса;
	движение.СуммаРасход = Данные.Шапка.СуммаКомиссии;
	
КонецПроцедуры

Процедура сформироватьДенежныеСредства ( Данные )
	
	п = Данные.Шапка;
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.ПеремещениеВКассу ) Тогда
		движение = Данные.Движения.ДенежныеСредства.ДобавитьРасход ();
		движение.Период = п.Дата;
		движение.Казна = п.Касса;
		движение.Валюта = п.Валюта;
		движение.Сумма = п.Сумма;
	Иначе
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.ДенежныеСредства.ДобавитьРасход ();
			движение.Период = п.Дата;
			движение.Казна = п.Касса;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Сумма = строкаТЗ.Сумма;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура сформироватьДвиженияДенежныхСредств ( Данные )
	
	п = Данные.Шапка;
	Если ( Данные.Шапка.ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.ПеремещениеВКассу ) Тогда
		движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
		движение.Период = п.Дата;
		движение.Казна = п.Касса;
		движение.Валюта = п.Валюта;
		движение.Организация = п.Организация;
		движение.СтатьяДДС = п.СтатьяДДС;
		движение.Контрагент = п.Контрагент;
		движение.СуммаПриход = 0;
		движение.СуммаРасход = п.Сумма;	
	Иначе
		Для Каждого строкаТЗ Из Данные.Оплаты Цикл
			движение = Данные.Движения.ДвиженияДенежныхСредств.Добавить ();
			движение.Период = п.Дата;
			движение.Казна = п.Касса;
			движение.Валюта = строкаТЗ.Валюта;
			движение.Организация = п.Организация;
			движение.СтатьяДДС = п.СтатьяДДС;
			движение.Контрагент = п.Контрагент;
			движение.СуммаПриход = 0;
			движение.СуммаРасход = строкаТЗ.Сумма;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура сформироватьПодотчет ( Данные )
	
	движение = Данные.Движения.Подотчет.ДобавитьПриход ();
	движение.Период = Данные.Шапка.Дата;
	движение.Сотрудник = Данные.Шапка.Сотрудник;
	движение.Валюта = Данные.Шапка.Валюта;
	движение.Сумма = Данные.Шапка.Сумма;
	
КонецПроцедуры

Процедура установитьФлагиЗаписи ( Данные )
	
	Данные.Движения.Взаиморасчеты.Записывать = ИСТИНА;
	Данные.Движения.ДенежныеСредства.Записывать = ИСТИНА;
	Данные.Движения.ДвиженияДенежныхСредств.Записывать = ИСТИНА;
	Данные.Движения.ДоходыРасходы.Записывать = ИСТИНА;
	Данные.Движения.Подотчет.Записывать = ИСТИНА;
	
КонецПроцедуры
